In [19]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb
from sklearn import linear_model

In [29]:
data=pd.read_csv("F:\Saad\Data Science\Machine Learning\Side Practice\Linear Regression multivariable\hiring.csv")

In [30]:
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [22]:
pip install word2number

^C
Note: you may need to restart the kernel to use updated packages.

In [31]:
import pandas as pd
from word2number import w2n

# Assuming you have a DataFrame named 'data'
# Replace null values in the entire DataFrame with 0
data.fillna(0, inplace=True)

# Define a function to convert the string experience values to numbers
def convert_experience(experience_str):
    try:
        # Use w2n to convert the string to a number
        return w2n.word_to_num(experience_str)
    except ValueError:
        # Handle cases where conversion to number is not possible
        return 0

# Apply the function to the "Experience" column
data['experience'] = data['experience'].apply(convert_experience)

# Now, the "Experience" column should contain numeric values with null values replaced by 0

In [32]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    0.0                           7      72000
7          11                    7.0                           8      80000

In [33]:
import math
# Calculate the median(floor) of the "test_score(out of 10)" column
median_test_score = math.ceil(data['test_score(out of 10)'].median())

# Replace 0 values with the median
data['test_score(out of 10)'] = data['test_score(out of 10)'].replace(0, median_test_score)

In [34]:
data

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [36]:
import pandas as pd

# Assuming you have a DataFrame named 'data' with the original column names
# Create a dictionary to map the old column names to the new ones
column_name_mapping = {
    'test_score(out of 10)': 'test_score',
    'interview_score(out of 10)': 'interview_score',
    'salary($)': 'salary_USD'
}

# Rename the columns using the rename method
data = data.rename(columns=column_name_mapping)

In [37]:
data

   experience  test_score  interview_score  salary_USD
0           0         8.0                9       50000
1           0         8.0                6       45000
2           5         6.0                7       60000
3           2        10.0               10       65000
4           7         9.0                6       70000
5           3         7.0               10       62000
6          10         8.0                7       72000
7          11         7.0                8       80000

In [40]:
LM=linear_model.LinearRegression()
LM.fit(data[["experience","test_score","interview_score"]], data.salary_USD)

LinearRegression()

In [41]:
LM.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [43]:
LM.intercept_

17737.26346433771

In [74]:
LM.predict([[2,9,6],[12,10,10]])

C:\ProgramData\anaconda3\Lib\site-packages\sklearn\base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671, 92002.18340611])

In [75]:
New_data = pd.read_csv("F:/Saad/Data Science/Machine Learning/Side Practice/Linear Regression multivariable/New_Data.csv")
New_data

   experience  test_score  interview_score
0           2           9                7
1           6           6                9
2           2           5               10
3           7           2               10
4           4           7                7
5           3           5                5

In [76]:
import pandas as pd
from sklearn.linear_model import LinearRegression

# Fit the model on your training data before making predictions
# LM.fit(X_train, y_train)

# Make predictions on the New_Data DataFrame
ba = LM.predict(New_data)

# Update the 'predicted_salary' column with the predicted values
New_data['predicted_salary'] = ba

# Now, New_Data should have a new column 'predicted_salary' with the predicted values

In [77]:
New_data

   experience  test_score  interview_score  predicted_salary
0           2           9                7      55411.208151
1           6           6                9      65536.390102
2           2           5               10      54644.104803
3           7           2               10      63171.761281
4           4           7                7      57345.705968
5           3           5                5      46430.858806